app/controllers/items_controller.rb

INSERT INTO "items" ("sku", "name", "desc", "price", "quantity", "created_at", "updated_at", "warehouse_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "items" ("sku", "name", "desc", "price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "warehouses".* FROM "warehouses" WHERE "warehouses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def create
    @item = Item.create(item_params)

    if @item.save
      @item.warehouse = Warehouse.find(params[:item][:warehouse_id])

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "warehouses".* FROM "warehouses" WHERE "warehouses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "updated_at" = ?, "warehouse_id" = ? WHERE "items"."id" = ?  [["updated_at", "2022-05-22 14:53:09.363865"], ["warehouse_id", 2], ["id", 1]]
---
  def update
    @item = Item.find(params[:id])
    @item.warehouse = Warehouse.find(params[:item][:warehouse_id])

    if @item.update(item_params)