app/controllers/warehouses_controller.rb

  def create
    @warehouse = Warehouse.create(warehouse_params)

    if @warehouse.save
---
INSERT INTO "warehouses" ("name", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Warehouse A"], ["location", "Some Location"], ["created_at", "2022-05-22 04:17:49.639156"], ["updated_at", "2022-05-22 04:17:49.639156"]]
INSERT INTO "warehouses" ("name", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Warehouse A"], ["location", "Some Location"], ["created_at", "2022-05-21 00:15:54.066031"], ["updated_at", "2022-05-21 00:15:54.066031"]]

  def update
    @warehouse = Warehouse.find(params[:id])

    if @warehouse.update(warehouse_params)
---
UPDATE "warehouses" SET "location" = ?, "updated_at" = ? WHERE "warehouses"."id" = ?  [["location", "some locatio"], ["updated_at", "2022-05-22 15:08:47.476588"], ["id", 2]]

  def destroy
    @warehouse = Warehouse.find(params[:id])
    @warehouse.destroy
---
DELETE FROM "warehouses" WHERE "warehouses"."id" = ?  [["id", 1]]